КАКерамика_моя_старая_база/src/Catalogs/ПравилаПолученияФактаПоСтатьямБюджетов/ПравилаПолученияФактаПоСтатьямБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПолученияФактаПоСтатьямБюджетов</name>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИтога</name>
    <type>
      <types>EnumRef.ТипыИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотПоАналитикеРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаИсточникаДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйРежимНастройкиЗаполненияАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики5</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики6</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточноеКэшированиеРезультатовРаботыПравил</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьПравило</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>String</types>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСуммыОперации</name>
    <type>
      <types>EnumRef.ПоказателиАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИсточникаДанных</name>
    <type>
      <types>EnumRef.РазделыИсточниковДанныхБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПравила</name>
    <type>
      <types>EnumRef.ТипПравилаПолученияФактическихДанныхБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСхемыКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХешиПересчитаны_2_4_1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХешиПересчитаны_2_4_3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КэшИменДокументовДляОбработкиПоПравилу/КэшИменДокументовДляОбработкиПоПравилу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КэшИменДокументовДляОбработкиПоПравилу</name>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаПолученияФактаПоСтатьямБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяВидаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Catalogs/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыБюджетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.МоделиБюджетирования</owners>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляВводаПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПланирования</name>
    <type>
      <types>EnumRef.СпособыСоставленияБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасположенияГраницыФактическихДанных</name>
    <type>
      <types>EnumRef.ВариантыРасположенияГраницыФактическиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовСкользящегоБюджета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеГраницыФакта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьГраницыФакта</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСпособВвода</name>
    <type>
      <types>EnumRef.СпособыРедактированияБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьЗащитуТабличногоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьБюджетВТабличнойФормеВЭкземпляреБюджета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьЭкземплярыБюджетовОтложено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаВидовБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПолученияДанных</name>
    <type>
      <types>EnumRef.РежимПолученияДанныхБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПривилегированныйДоступКДанным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АналитикиШапки</name>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КэшСтатейИПоказателей</name>
    <attributes>
      <name>СтатьяПоказатель</name>
      <type>
        <types>CatalogRef.СтатьиБюджетов</types>
        <types>CatalogRef.ПоказателиБюджетов</types>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПривилегированныйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/ПравилаПолученияФактаПоСтатьямБюджетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ИсточникСуммыОперации");
	МассивНепроверяемыхРеквизитов.Добавить("ТипИтога");
	
	Если НЕ ЗначениеЗаполнено(РазделИсточникаДанных) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникДанных");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	НеЗаполненИсточникСуммыОперации = 
		РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.ОперативныйУчет И Не ЗначениеЗаполнено(ИсточникСуммыОперации);
		
	НеЗаполненТипИтога = (РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.РегламентированныйУчет
						ИЛИ РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.МеждународныйУчет)
						И Не ЗначениеЗаполнено(ТипИтога);
	
	Если НеЗаполненИсточникСуммыОперации Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Поле Источник суммы не заполнено'"), ,"ИсточникСуммыОперации", "Запись", Отказ);
	КонецЕсли;
	Если НеЗаполненТипИтога Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Поле Тип итога не заполнено'"), ,"ТипИтога", "Запись", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Наименование = Строка(РазделИсточникаДанных) + ": " + ИсточникДанных;
	Если ЗначениеЗаполнено(КорСчет) Тогда
		Наименование = Наименование + ", " + КорСчет;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИсточникСуммыОперации) Тогда
		Наименование = Наименование + ", " + ИсточникСуммыОперации;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТипИтога) Тогда
		Наименование = Наименование + ", " + ТипИтога;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПредставлениеОтбора) Тогда
		Наименование = Наименование + ", " + ПредставлениеОтбора;
	КонецЕсли;
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	Для Сч = 1 По МаксимальноеКоличествоАналитик Цикл
		
		Если ЭтотОбъект["ЗаполнятьУказаннымЗначениемАналитику" + Сч]
		   И ЗначениеЗаполнено(СтатьяБюджетов["ВидАналитики" + Сч]) Тогда
			
			ТипАналитики = СтатьяБюджетов["ВидАналитики" + Сч].ТипЗначения;
			ЭтотОбъект["ЗначениеАналитики" + Сч] = БюджетированиеКлиентСервер.ПриведенноеЗначениеАналитики(
				ЭтотОбъект["ЗначениеАналитики" + Сч],
				ТипАналитики);
				
		Иначе
			
			ЭтотОбъект["ЗначениеАналитики" + Сч] = БюджетированиеКлиентСервер.ПустоеЗначениеАналитики();
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сделаем слепок настроек и схемы для будущего сравнения их между собой без анализа каждого элемента.
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		БюджетированиеСервер.ЗаполнитьРеквизитыХешейНастроекИСхемы(ЭтотОбъект);
	КонецЕсли;
	
	// Заполним настройки заполнения аналитик
	Если Не ЭтотОбъект.РасширенныйРежимНастройкиЗаполненияАналитики Тогда
		БюджетированиеСервер.ЗаполнитьРеквизитыОбъектаНастроекЗаполненияАналитики(ЭтотОбъект);
	КонецЕсли;
	
	ПроверкаИзмененияКэшированныхДанных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаИзмененияКэшированныхДанных()
	
	ОчищатьКэшИменДокументов = Ложь;
	ОчищатьКэшВидовБюджетов  = Ложь;
	
	Если НЕ ЭтоНовый() Тогда
		
		ПредыдущиеПараметрыОтраженияДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"ПромежуточноеКэшированиеРезультатовРаботыПравил, ИсточникДанных, РазделИсточникаДанных, ТипПравила, ХешСхемыКомпоновкиДанных, ПометкаУдаления");
		
		Если ПромежуточноеКэшированиеРезультатовРаботыПравил
			ИЛИ ПредыдущиеПараметрыОтраженияДокументов["ПромежуточноеКэшированиеРезультатовРаботыПравил"] Тогда
			
			Для каждого КлючИЗначение Из ПредыдущиеПараметрыОтраженияДокументов Цикл
				Если ЭтотОбъект[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
					Если КлючИЗначение.Ключ = "ПромежуточноеКэшированиеРезультатовРаботыПравил" Тогда
						ОчищатьКэшИменДокументов = Истина;
						ОчищатьКэшВидовБюджетов  = Истина;
					ИначеЕсли КлючИЗначение.Ключ = "ПометкаУдаления" Тогда
						ОчищатьКэшВидовБюджетов  = Истина;
					Иначе
						ОчищатьКэшИменДокументов = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ЭтоНовый()
		И ПромежуточноеКэшированиеРезультатовРаботыПравил Тогда
		ОчищатьКэшВидовБюджетов = Истина;
	КонецЕсли;
	
	Если ОчищатьКэшИменДокументов Тогда
		ИменаОтражаемыхДокументов = РегистрыСведений.КэшИменДокументовДляОбработкиПоПравилу.СоздатьНаборЗаписей();
		ИменаОтражаемыхДокументов.Отбор.Правило.Установить(Ссылка);
		УстановитьПривилегированныйРежим(Истина);
		ИменаОтражаемыхДокументов.Записать(Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Если ОчищатьКэшВидовБюджетов Тогда
		ИспользующиеВидыБюджета = ПолучитьИспользующиеПравилоВидыБюджета();
		Для каждого ВидБюджета Из ИспользующиеВидыБюджета Цикл
			НаборПоВидуБюджета = РегистрыСведений.КэшВспомогательныхДанныхВидаБюджета.СоздатьНаборЗаписей();
			НаборПоВидуБюджета.Отбор.ВидБюджета.Установить(ВидБюджета);
			УстановитьПривилегированныйРежим(Истина);
			НаборПоВидуБюджета.Записать(Истина);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИспользующиеПравилоВидыБюджета()
	
	// Правило получения фактических данных по статье может использоваться в кэше
	// для получения факта по статье или как факт, влияющий на показатель.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьяБюджетов", СтатьяБюджетов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвязиПоказателейБюджетов.СвязанныйПоказательБюджетов КАК СтатьяПоказатель
	|ПОМЕСТИТЬ СтатьиИПоказатели
	|ИЗ
	|	РегистрСведений.СвязиПоказателейБюджетов КАК СвязиПоказателейБюджетов
	|ГДЕ
	|	СвязиПоказателейБюджетов.СтатьяБюджетов = &СтатьяБюджетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиБюджетов.Ссылка
	|ИЗ
	|	Справочник.СтатьиБюджетов КАК СтатьиБюджетов
	|ГДЕ
	|	СтатьиБюджетов.Ссылка = &СтатьяБюджетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяПоказатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыБюджетовКэшСтатейИПоказателей.Ссылка КАК ВидБюджета
	|ИЗ
	|	Справочник.ВидыБюджетов.КэшСтатейИПоказателей КАК ВидыБюджетовКэшСтатейИПоказателей
	|ГДЕ
	|	ВидыБюджетовКэшСтатейИПоказателей.СтатьяПоказатель В
	|			(ВЫБРАТЬ
	|				Т.СтатьяПоказатель
	|			ИЗ
	|				СтатьиИПоказатели КАК Т)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидБюджета");
	
КонецФункции

#КонецОбласти

#КонецЕсли
